# Физмат школа
# Оценка по физике (2, 3, 4, 5)
# Психическое состояние (0, 1)
# Средний аттестат (2, 3, 4, 5)
# Рост (160...200)
# Вес (40...200)
# Оценка по математике (2, 3, 4, 5)

student = [
    [4, 0, 3, 175, 55, 5],
    [3, 1, 4, 200, 70, 3],
    [5, 1, 4, 169, 69, 5],
    [5, 1, 5, 183, 62, 4],
    [2, 0, 2, 171, 171, 2],
    [3, 1, 5, 160, 200, 4]
]

# средний аттестат, математика, физика, психика, вес, рост

print(sorted(student, key=lambda x: (x[2], x[5], x[0], x[1], x[4], x[3]), reverse=True))